OpenFOAM-6-AP/tutorials/combustion/fireFoam/LES/smallPoolFire3D/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

combustionModel infinitelyFastChemistry;

active  on;

infinitelyFastChemistryCoeffs
{
    semiImplicit no;
    C       5.0;
}


// ************************************************************************* //
